Repository: 84000/data-translation-memory
Catalog: toh556-v3.tmx
Source language: bo
Languages: en

source: འདི་ལྟ་སྟེ་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་གྲངས་མ་མཆིས་པ་དུ་མ་དེ་དག་ནི། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལས། དེ་བཞིན་གཤེགས་པའི་མིང་དུ་ལུང་བསྟན་པ་མ་ཐོབ་ཀྱི་བར་དུ་སྔོན་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་གྲངས་མ་མཆིས་པ་དུ་མ་ནས། དེ་དག་ནི་དེ་བཞིན་གཤེགས་པ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་གྲངས་མ་མཆིས་པ་དུ་མ་དག་ལ་མཆོད་པ་སྣ་ཚོགས་ཐ་དད་པ་འབུམ་ཕྲག་བསམ་གྱིས་མི་ཁྱབ་པ་དུ་མ་དག་དང་། ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་མཆོད་པར་བགྱིས།
en: “Countless hundreds of thousands of quintillions of bodhisattvas have, before they received from buddha bhagavats their names as tathāgatas, made countless hundreds of thousands of various offerings and all requisites to countless hundreds of thousands of quintillions of tathāgatas for countless hundreds of thousands of quintillions of eons.

source: ཡོངས་སུ་གཏང་བར་བགྱི་བའི་དངོས་པོ་ཐམས་ཅད་ཡོངས་སུ་བཏང་། ལག་པ་དང་། རྐང་པ་དང་།
en: They had given away all the things that could be given away.

source: མིག་དང་། ཡན་ལག་གི་དམ་པ་མགོ་དང་། བུ་དང་། ཆུང་མ་དང་། བུ་མོ་ཕངས་པ་ཡོངས་སུ་གཏང་བར་བགྱི་བ་རྣམས་ཀྱང་ཡོངས་སུ་བཏང་། ནོར་དང་།
en: They had given away their arms, legs, eyes, the supreme limb of the head, and their beloved sons, wives, and daughters.

source: འབྲུ་དང་། འགྲོན་བུ་དང་། གསེར་དང་། ནོར་བུ་དང་། མུ་ཏིག་དང་། བཻ་ཌཱུརྱ་དང་། དུང་དང་། མན་ཤེལ་དང་། བྱི་རུ་དང་། དངུལ་དང་། ས་ལེ་སྦྲམ་རྣམས་ཡོངས་སུ་གཏང་བར་བགྱི་བ་རྣམས་ཀྱང་ཡོངས་སུ་བཏང་། བཟའ་བ་དང་། བཏུང་བ་དང་། བཞོན་པ་དང་། གོས་དང་། མལ་ཆ་དང་། སྟན་དང་།
en: They had given away wealth, grain, cowries, gold, silver, jewels, pearls, beryl, conchs, crystals, coral, silver, and gold nuggets.

source: ཁང་ཁྱིམ་དང་། གཞལ་མེད་ཁང་དང་། ཀུན་དགའ་ར་བ་དང་། སྐྱེད་མོས་ཚལ་དང་། རྫིང་བུ་དང་། ལྡེང་ཀ་དང་། གླང་པོ་ཆེ་དང་། བ་ལང་དང་། རྟ་ཕོ་རྒོད་དང་། བྲན་ཕོ་དང་། བྲན་མོ་ཡོངས་སུ་གཏང་བར་བགྱི་བ་རྣམས་ཀྱང་ཡོངས་སུ་བཏང་ཞིང་།
en: They had given away food, drink, steeds, clothes, beds, seats, houses, divine palaces, parks, pleasure groves, ponds, pools, elephants, oxen, stallions, male servants, and female servants.

source: རིམ་གྱིས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བགྱིད། རིམ་གྱིས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་དག་ཡོངས་སུ་རྫོགས་པར་བགྱིས་ནས། བདེ་བ་འབུམ་ཕྲག་མང་པོ་ཡང་འབྱོར་བར་འགྱུར་ན། བཙུན་པ་བཅོམ་ལྡན་འདས་རྒྱུ་གང་དང་། རྐྱེན་གང་དང་། དགེ་བའི་རྩ་བ་སྦྱངས་པ་ཅི་འདྲ་བ་ཞིག་གིས། འབར་བའི་ཁྱད་པར་གྱི་གཟི་བརྗིད་ཀྱི་རྒྱལ་པོ་ལ་སོགས་པ།
en: They had successively completed all the six perfections and, having successively completed all the six perfections, they experienced many hundreds of thousands of kinds of happiness.

source: ལྷའི་བུ་ཁྲི་པོ་འདི་དག་བཅོམ་ལྡན་འདས་ལ་ཆོས་ཉན་པའི་སླད་དུ་མཆིས་པ། འདི་དག་བཅོམ་ལྡན་འདས་ཀྱིས་འདི་ལྟར་མ་འོངས་པའི་དུས་ན། བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་གྲངས་མེད་པ་དུ་མ་ན། འཇིག་རྟེན་གྱི་ཁམས་སཱ་ལའི་དབང་པོ་མཐོན་པོའི་རྒྱལ་མཚན་དང་ལྡན་པ་ཞེས་བྱ་བ་དེ་ཉིད་དུ་རིགས་དང་རུས་གཅིག་པ་དང་མིང་གཅིག་ཏུ་རིམ་གྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ། རབ་ཏུ་དང་བའི་ཞལ་ཨུཏྤ་ལའི་དྲི་བརྩེགས་པ་ཞེས་བྱ་བ་སངས་རྒྱས་ཁྲི་འཇིག་རྟེན་དུ་འབྱུང་སྟེ། རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་སུ་འགྱུར་རོ་ཞེས་ད་ལྟར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་ལགས། དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: “Venerable Bhagavat, through what cause and what condition, through what manner of developing good roots, have Jvalanāntara­tejo­rāja and the rest of these ten thousand devas who have come here to hear the Dharma from the Bhagavat been prophesied to successively appear, Bhagavat, in a future time, after many hundreds of thousands of quintillions of asaṃkhyeya eons, in a world realm called Śālendra­dhvajāgravatī, in the same family, in the same clan, and with the same name to attain the highest, most complete enlightenment of perfect buddhahood, as ten thousand buddhas by the name of Prasanna­vadanotpala­gandha­kūṭa, becoming tathāgatas, arhats, samyaksaṃbuddhas, with wisdom and virtuous conduct, sugatas, knowers of the world’s beings, unsurpassable guides who tame beings, teachers of devas and humans, buddhas, and bhagavats?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་རིགས་ཀྱི་ལྷ་མོ་བྱང་ཆུབ་ཡང་དག་པར་བསྡུས་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་ལྷ་མོ་འབར་བའི་ཁྱད་པར་གྱི་གཟི་བརྗིད་ཀྱི་རྒྱལ་པོ་ལ་སོགས་པ་ལྷའི་བུ་ཁྲི་པོ་འདི་དག་གང་བྱས་ཤིང་བསགས་པས་ཆོས་མཉན་པའི་ཕྱིར། ད་ལྟར་སུམ་ཅུ་རྩ་གསུམ་གྱི་གནས་ནས། འདིར་ལྷགས་པ་དེའི་དགེ་བའི་རྩ་བ་སྦྱངས་པ་ཡོད། དེའི་རྒྱུ་ཡོད།
en: When she had asked that, the Bhagavat said, “Noble goddess, Jvalanāntara­tejo­rāja and the rest of these ten thousand devas do have a development of good roots, do have a cause, and do have deeds that they have accomplished and accumulated, through which they have come here from the paradise of Trāyastriṃśa in order to hear the Dharma.

source: དེའི་བྱེད་རྒྱུ་ཡོད་དེ། རིགས་ཀྱི་ལྷ་མོ་སྐྱེས་བུ་དམ་པ་འདི་གསུམ་གྱིས་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་འདི་ཐོས་ནས་ཐོས་མ་ཐག་ཏུ་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ལས། ཤིན་ཏུ་རི་མོར་བྱེད་ཅིང་དགའ་བ་དང་དང་བ་ཐོབ་པར་གྱུར་ཏོ། །དེ་ཙམ་དུ་བཻ་ཌཱུརྱ་དྲི་མ་མེད་པ་ལྟར་ཡོངས་སུ་དག་པའི་སེམས་དང་ལྡན་པར་གྱུར་ཏོ། །
en: “Noble goddess, when they heard the prophecy of the enlightenment of these three excellent beings, as soon as they heard it, they gained reverence for, delight in, and trust in this Lord King of Sūtras, the Sublime Golden Light, and just through that they had minds that were as completely pure as stainless beryl.

source: དྲི་མ་མེད་ལ་ཤིན་ཏུ་རྒྱ་ཆེ་ཞིང་རྒྱས་པའི་ནམ་མཁའ་ལྟར་ཟབ་པའི་སེམས་རབ་ཏུ་དང་བ་དང་ལྡན་པར་གྱུར་ཏོ། །
en: They had profound, completely clear minds like pure, extremely vast, and expansive space.

source: བསོད་ནམས་ཀྱི་ཕུང་པོ་དཔག་ཏུ་མེད་པ་ཡོངས་སུ་བཟུང་བ་དང་ལྡན་པར་གྱུར་ཏོ། །
en: They possessed an immeasurable accumulation of merit.

source: རིགས་ཀྱི་ལྷ་མོ་འབར་བའི་ཁྱད་པར་གྱི་གཟི་བརྗིད་ཀྱི་རྒྱལ་པོ་ལ་སོགས་པ་ལྷའི་བུ་ཁྲི་པོ་འདི་དག་དེ་ཙམ་དུ་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ཐོས་མ་ཐག་ཏུ། ལྷག་པར་རི་མོ་བྱེད་པ་དང་།
en: “Noble goddess, Jvalanāntara­tejo­rāja and the rest of these ten thousand devas, in just that way, as soon as they heard this king that is The Lord King of Sūtras, the Sublime Golden Light, gained reverence for and trust in it.

source: རབ་ཏུ་དང་བ་ཐོབ་པར་གྱུར་ཏོ། །དེ་ཙམ་དུ་བཻ་ཌཱུརྱ་དྲི་མ་མེད་པ་ལྟར་ཡོངས་སུ་དག་པའི་སེམས་དང་ལྡན་པར་གྱུར་ཏེ། དེའི་ཕྱིར་ལུང་བསྟན་པས་རྗེས་སུ་སྟོན་ཏོ། །
en: In just that way, they had minds that were as completely pure as stainless beryl, and therefore they attained the level of prophecy.

source: རིགས་ཀྱི་ལྷ་མོ་ཆོས་མཉན་པའི་དགེ་བའི་རྩ་བ་བསགས་པ་འདི་དང་། སྔོན་གྱི་སྨོན་ལམ་གྱི་སྟོབས་ཀྱིས་འབར་བའི་ཁྱད་པར་གྱི་གཟི་བརྗིད་ཀྱི་རྒྱལ་པོ་ལ་སོགས་པ་ལྷའི་བུ་ཁྲི་པོ་འདི་དག །ད་ལྟར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་ཏོ། །
en: “Noble goddess, it is through this accumulation of good roots and through the power of previous prayers that Jvalanāntara­tejo­rāja and the rest of these ten thousand devas have now obtained the prophecy of their highest, most complete enlightenment.”

source: ལྷའི་བུ་སྟོང་ཕྲག་བཅུ་ལུང་བསྟན་པའི་ལེའུ་སྟེ་ཉི་ཤུ་རྩ་གསུམ་པའོ།། །།རིགས་ཀྱི་ལྷ་མོ་སྔོན་གྱི་སྨོན་ལམ་དེ་དག་གང་ཞེ་ན། རིགས་ཀྱི་ལྷ་མོ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། བསྐལ་པ་གྲངས་མེད་པའི་ཡང་ཆེས་གྲངས་མེད་པ་རྒྱས་པ་བསམ་གྱིས་མི་ཁྱབ་པ། ཚད་མེད་པར་གྱུར་པ་དེའི་ཚེ། དེའི་དུས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ།
en: Chapter 24: Ending All Illness “Noble goddess, what were those past prayers?

source: འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རིན་ཆེན་གཙུག་ཏོར་ཅན་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་ངོ་། །
en: In the past, in a time gone by—an inconceivable, vast number, more innumerable than an asaṃkhyeya of eons ago—at that time, in that time, the tathāgata arhat samyaksaṃbuddha, the one with wisdom and virtuous conduct, the sugata, the one who knows the world’s beings, the unsurpassable guide who tames beings, the teacher of devas and humans, the buddha, the bhagavat by the name of Ratnaśikhin appeared in the world.

source: རིགས་ཀྱི་ལྷ་མོ་དེའི་ཚེ་དེའི་དུས་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གཙུག་ཏོར་ཅན་དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས། དམ་པའི་ཆོས་ནུབ་པར་གྱུར་ཏེ། དམ་པའི་ཆོས་ལྟར་བཅོས་པར་གྱུར་པ་ན། རྒྱལ་པོ་ལྷའི་དབང་ཕྱུག་འོད་ཅེས་བྱ་བ། ཆོས་ཅན་ཆོས་ཀྱི་རྒྱལ་པོ།
en: “Noble goddess, at that time, in that time, after the tathāgata arhat samyaksaṃbuddha Ratnaśikhin had passed into nirvāṇa and the Dharma had vanished and there was just the outer appearance of the Dharma, there was King Sureśvaraprabha, who followed the Dharma, who was a Dharma king, who ruled the kingdom through the Dharma and not through that which was not the Dharma, and who was like a father and mother to the beings who dwelled there.

source: ཆོས་ཀྱིས་རྒྱལ་སྲིད་སྐྱོང་གི །ཆོས་མ་ཡིན་པས་མ་ཡིན་ཏེ། ཡུལ་ཐམས་ཅད་ན་གནས་པའི་སེམས་ཅན་རྣམས་ཀྱི་ཕ་མ་ལྟ་བུར་གྱུར་པ་ཞིག་བྱུང་ངོ་། །རིགས་ཀྱི་ལྷ་མོ་དེའི་ཚེ་དེའི་དུས་ན། རྒྱལ་པོ་ལྷའི་དབང་ཕྱུག་འོད་ཀྱི་ཡུལ་དུ་ཚོང་དཔོན་རལ་པ་འཛིན་ཅེས་བྱ་བ།
en: “Noble goddess, at that time, in that time, in the kingdom of King Sureśvaraprabha, there was a head merchant by the name of Jaṭiṃdhara.

source: སྨན་པ་གསོ་བ་བྱེད་པ་ཁམས་ལ་མཆོག་ཏུ་མཁས་པ་ཚེའི་རིག་བྱེད་ཡན་ལག་བརྒྱད་ཀྱི་རྒྱུད་དང་ལྡན་པ་ཞིག་བྱུང་བར་གྱུར་ཏོ། །ཀྱེ་རིགས་ཀྱི་ལྷ་མོ་དེའི་ཚེ་དེའི་དུས་ན། ཚོང་དཔོན་རལ་པ་འཛིན་ཅེས་བྱ་བ་དེའི་བུ་ཚོང་དཔོན་གྱི་བུ་ཆུ་འབེབས་ཞེས་བྱ་བ། གཟུགས་བཟང་བ།
en: He was a doctor, a physician, perfectly skilled in the humors, and was endowed with all eight branches of the Āyurveda tradition.

source: མཛེས་པ། བལྟ་ན་སྡུག་པ། ཁ་དོག་བཟང་པོ། རྒྱས་པ་མཆོག་དང་ལྡན་པ། བསྟན་བཅོས་སྣ་ཚོགས་ལ་མཁས་པ། བསྟན་བཅོས་ཐམས་ཅད་རྟོགས་པར་ཁོང་དུ་ཆུད་པ། ཡི་གེ་དང་། གྲངས་དང་། ལག་རྩིས་དང་། རྩིས་རྣམས་ཤིན་ཏུ་བསླབས་པར་གྱུར་པ་ཞིག་བྱུང་ངོ་། །
en: “O noble goddess, at that time, in that time, the head merchant Jaṭiṃdhara had a son named Jalavāhana, who had an excellent body; was attractive and handsome; had a perfect, well-developed, excellent complexion; was learned in various treatises; had the understanding of all treatises; and was perfectly trained in letters, numbers, finger-counting, and calculations.

source: རིགས་ཀྱི་ལྷ་མོ་དེའི་ཚེ་དེའི་དུས་ན། རྒྱལ་པོ་ལྷའི་དབང་ཕྱུག་འོད་དེའི་ཡུལ་དེ་ན་སེམས་ཅན་འབུམ་ཕྲག་དུ་མ་ནད་སྣ་ཚོགས་ཀྱིས་བཏབ་པར་གྱུར་ཅིང་། ནད་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་གཟིར་བར་གྱུར་ཏེ། སྡུག་བསྔལ་མི་བཟད་པ། རྩུབ་པ།
en: “Noble goddess, at that time, in that time, many hundreds of thousands of beings living in the kingdom of King Sureśvaraprabha were afflicted by various illnesses, tormented by various illnesses, and were experiencing severe, terrible, unendurable, unpleasant sensations of suffering.

source: དྲག་པོ་ཡིད་དུ་མི་འོང་བའི་ཚོར་བ་རྣམས་མྱོང་བར་གྱུར་ཏོ། །རིགས་ཀྱི་ལྷ་མོ་དེའི་ཚེ་དེའི་དུས་ན། ཚོང་དཔོན་གྱི་བུ་ཆུ་འབེབས་དེ་སེམས་ཅན་ནད་སྣ་ཚོགས་ཀྱིས་བཏབ་པ་ནད་སྣ་ཚོགས་ཀྱིས་གཟིར་བ། འབུམ་ཕྲག་དུ་མ་དེ་དག་གི་དོན་གྱི་ཕྱིར། སྙིང་རྗེ་ཆེན་པོའི་སེམས་སྐྱེས་པར་གྱུར་ཏོ། །སེམས་ཅན་འབུམ་ཕྲག་དུ་མ་དེ་དག་ནི་ནད་སྣ་ཚོགས་ཀྱིས་བཏབ་ཅིང་ནད་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་གཟིར་ཏེ། དེ་ལྟར་སྡུག་བསྔལ་མི་བཟད་པ། རྩུབ་པ།
en: “Noble goddess, at that time, in that time, there arose in Jalavāhana, the head merchant’s son, great compassion for those many hundreds of thousands of beings who were afflicted by various illnesses and tormented by various illnesses.

source: དྲག་པོ་ཡིད་དུ་མི་འོང་བའི་ཚོར་བ་རྣམས་མྱོང་ལ། བདག་གི་ཕ་ཚོང་དཔོན་རལ་པ་འཛིན་སྨན་པ་གསོ་བར་བྱེད་པ་ཁམས་ལ་མཆོག་ཏུ་མཁས་པ། ཚེའི་རིག་བྱེད་ཡན་ལག་བརྒྱད་ཀྱི་རྒྱུད་དང་ལྡན་པ་འདི་ནི། རྒས། འཁོགས། གཏུགས། ལམ་དུ་ཞུགས། ན་ཚོད་རྗེས་སུ་ཐོབ་འཁར་བ་ལ་བརྟེན་ཅིང་འདར་ཏེ། གྲོང་དང་།
en: He thought, ‘Those beings are experiencing severe, terrible, unendurable, unpleasant sensations of suffering, and my father, this head merchant Jaṭiṃdhara, who is a doctor, a physician, perfectly skilled in the humors, and endowed with all eight branches of the Āyurveda tradition, has become old, decrepit, and feeble.

source: གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ལྗོངས་དང་། ཡུལ་འཁོར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་རྣམས་སུ་འགྲོ་བར་མི་ནུས་ན།
en: He has reached an advanced age, walks leaning on a stick, and is unable to go to the villages, the towns, the market towns, the countryside, the realm, or the royal capital.

source: སེམས་ཅན་ནད་སྣ་ཚོགས་ཀྱིས་བཏབ་པ། ནད་སྣ་ཚོགས་ཀྱིས་གཟིར་བ། འབུམ་ཕྲག་དུ་མ་དེ་དག་ནད་སྣ་ཚོགས་ལས་ཡོངས་སུ་ཐར་བར་བྱ་བའི་ཕྱིར། བདག་ཉིད་བདག་གི་ཕ་རལ་པ་འཛིན་གྱི་གན་དུ་སོང་ལ། ནད་ཀྱི་ཕྱིར་ཁམས་ལ་མཁས་པར་བྱ་བ་ཡོངས་སུ་དྲིས་ཏེ། ཁམས་ལ་མཁས་པར་བྱ་བ་དྲིས་པ་དེས་བདག་གྲོང་དང་།
en: Therefore, in order to free those many hundreds of thousands of beings from the afflictions of various illnesses and the torments of various illnesses, I will go to my father, Jaṭiṃdhara, and question him so as to become skilled in the humors in order to heal illness.

source: གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ལྗོངས་དང་། ཡུལ་འཁོར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་རྣམས་སུ་འགྲོ་བར་བྱའོ། །
en: Having questioned him so as to become skilled in the humors, I will go to the villages, towns, market towns, countryside, realm, and royal capital.

source: སོང་ནས་ཀྱང་སེམས་ཅན་ནད་སྣ་ཚོགས་ཀྱིས་བཏབ་པ། ནད་སྣ་ཚོགས་ཀྱིས་གཟིར་བ་འབུམ་ཕྲག་དུ་མ་དག་ནད་སྣ་ཚོགས་ལས་ཡོངས་སུ་ཐར་བར་བྱའོ་སྙམ་ནས་རིགས་ཀྱི་ལྷ་མོ་དེའི་ཚེ་དེའི་དུས་ན།
en: When I go there, I will free the many hundreds of thousands of beings from illness.’

source: ཚོང་དཔོན་གྱི་བུ་ཆུ་འབེབས་རང་གི་ཕ་རལ་པ་འཛིན་ག་ལ་བ་དེར་སོང་སྟེ། ཕྱིན་ནས་རང་གི་ཕ་རལ་པ་འཛིན་གྱི་རྐང་པ་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ཐལ་མོ་སྦྱར་ནས་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ །
en: “Noble goddess, at that time, in that time, Jalavāhana, the head merchant’s son, went to his father, Jaṭiṃdhara, and having come to him, he bowed down his head in homage at his father’s feet, and with his palms together he sat to one side.

source: ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་ཀྱང་། ཚོང་དཔོན་གྱི་བུ་ཆུ་འབེབས་ཀྱིས་རང་གི་ཕ་རལ་པ་འཛིན་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་ཁམས་ལ་མཁས་པར་བྱ་བ་དྲིས་པ། ཇི་ལྟར་དབང་པོ་འཇིག་འགྱུར་ཞིང་། །ཁམས་རྣམས་ཀྱང་ནི་ཡོངས་སུ་འགྱུར། །
en: When he had seated himself to one side, Jalavāhana, the head merchant’s son, recited these verses to his father, Jaṭiṃdhara, questioning him about skill in the humors: “ ‘How are physical powers destroyed And how do the humors change?

source: གང་གི་དུས་ན་ལུས་ཅན་ལ། །ནད་ཀྱི་རིགས་རྣམས་འབྱུང་བར་འགྱུར། །
en: At what times do illnesses Arise within physical beings?

source: དུས་དང་དུས་མིན་ཟས་ཟོས་པ། །ཇི་ལྟ་བུར་ན་བདེ་བར་འགྱུར། །གང་གི་ལུས་ཀྱི་ནང་དུ་ནི། །ལུས་ཀྱི་མི་ལ་གནོད་མི་འགྱུར། །
en: “ ‘What foods should be eaten or not At different times for health, So that within someone’s body The body’s heat will not be harmed?

source: རླུང་ལས་གྱུར་དང་མཁྲིས་གྱུར་དང་། །འདུས་ལས་གྱུར་དང་བད་ཀན་གྱུར། །ནད་རྣམས་ཞི་བར་བགྱི་སླད་དུ། །ཅི་ལྟ་བུར་ནི་གསོ་བར་བགྱི། །
en: “ ‘What are the medical practices For healing the illnesses That arise from air, from bile, From phlegm, and from their combination?

source: གང་གིས་མི་ལ་གནོད་འགྱུར་བའི། །རླུང་ནི་གང་གི་དུས་ན་གཡོ། །གང་གི་དུས་ན་མཁྲིས་པ་གཡོ། །བད་ཀན་གང་གི་དུས་ན་གཡོ། །
en: “ ‘During which times does the air move, During which times does the bile move, And during which times does the phlegm move, Through which there will be harm to humans?’

source: དེ་ནས་ཚོང་དཔོན་རལ་པ་འཛིན་གྱིས་ཚོང་དཔོན་གྱི་བུ་ཆུ་འབེབས་ལ། །ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་ཁམས་ལ་མཁས་པར་བྱ་བ་རྣམ་པར་བསྟན་ཏོ། །ཟླ་གསུམ་དབྱར་ཏེ་ཟླ་གསུམ་སྟོན་དུ་ཤེས། །གསུམ་ནི་དགུན་ཏེ་གསུམ་ནི་དཔྱིད་ཡིན་ནོ། །
en: “Then the head merchant, Jaṭiṃdhara, taught his son Jalavāhana skill in the humors by reciting these verses: “ ‘Know three months to be summer and three months the autumn, And there are three that are winter and three that are spring.

source: དེ་ལྟར་ཟླ་བའི་གོ་རིམས་དུས་ནི་དྲུག །ལོ་གཅིག་ལ་ནི་ཟླ་བ་བཅུ་གཉིས་འདོད། །
en: Similarly, there are said to be six seasons, And there are twelve months in one year.

source: གསུམ་གསུམ་དུ་ནི་ཚིགས་རྣམས་སྡུད་པར་ཤེས། །ཟླ་བ་གཉིས་གཉིས་ཤིང་ནི་དུས་སུ་བསྟན། །
en: “ ‘Know that the months are divided into threes, And that pairs of months are taught.

source: ཟས་དང་སྐོམ་ནི་དེ་ལྟར་འཇུ་བར་འགྱུར། །
en: Food and drink are digested accordingly.

source: སྨན་པ་དང་ནི་ཁམས་དང་དུས་ཀྱང་བསྟན། །
en: Thus the physicians teach humors and time.

source: དབང་པོ་དང་ནི་ཁམས་རྣམས་དེ་དག་ཀྱང་། །ལོ་གཅིག་ནང་གི་ཚིགས་ཚིགས་ཡོངས་སུ་འགྱུར། །དབང་པོ་དག་ནི་ཡོངས་སུ་འགྱུར་བ་ན། །
en: “ ‘The faculties and the humors Are in groups within each year.

source: ལུས་ཅན་རྣམས་ལ་སྣ་ཚོགས་ནད་ཀྱང་འབྱུང་། །དེ་ཉིད་ལ་ནི་སྨན་པས་ཟླ་གསུམ་བཞི། །ཚིགས་ཀྱི་བར་དང་དུས་དྲུག་རྣམས་དང་ནི། །ཁམས་དྲུག་མཁས་པར་བྱ་བ་ཤེས་པར་བྱ། །ཟས་སྐོམ་སྨན་རྣམས་གོ་རིམས་ཇི་བཞིན་ཏེ། །
en: It is when the faculties transform That various illnesses arise in beings “ ‘Know that the physician must be skilled In the groups of three and four months, The six times and the six humors, And the food, drink, and medicines that correspond.

source: རླུང་གི་ཤས་ཆེའི་ནད་ནི་དབྱར་ན་ལྡང་། །
en: “ ‘Illness that is primarily air arises in the summer.

source: སྟོན་དུ་གྱུར་པ་ན་ནི་མཁྲིས་པ་གཡོ། །དགུན་གྱི་དུས་སུ་དེ་བཞིན་འདུས་པ་སྟེ། །
en: That which arises in the autumn is the movement of bile.

source: བད་ཀན་ཤས་ཆེའི་ནད་ནི་དཔྱིད་ལྡང་ངོ་། །
en: Similarly, during the time of winter it is the aggregation, And illness that is primarily phlegm arises in spring.

source: དབྱར་ནི་སྣུམ་དྲོ་ལན་ཚྭ་སྐྱུར་བའི་རོ། །སྟོན་ནི་མངར་དང་སྣུམ་དང་བསིལ་བག་གོ། །དགུན་ནི་མངར་དང་སྣུམ་དང་སྐྱུར་བག་སྟེ། །དཔྱིད་ཀྱི་དུས་ན་རྩུབ་རོ་ཚྭ་བའོ། །
en: “ ‘In summer: oily, pungent, salty, and sour tastes; In autumn: the sweet, the oily, and the cool; In winter: the sweet, the oily, and the sour; And in the time of spring, the astringent, pungent, and bitter.

source: བད་ཀན་ཆེ་བ་ཟོས་མ་ཐག་ཏུ་ལྡང་། །
en: “ ‘That which is primarily phlegm arises immediately after eating.

source: མཁྲིས་པ་ཆེ་བ་འཇུ་བའི་དུས་ན་ལྡང་། །
en: That which is primarily bile arises during digestion.

source: རླུང་ཤས་ཆེ་བ་ཞུ་མ་ཐག་ཏུ་ལྡང་། །
en: That which is primarily air arises immediately after digestion.

source: ཁམས་གསུམ་གཡོ་བ་དེ་ནི་དེ་ལྟའོ། །
en: That which is the movement of all three humors is like that.

source: རླུང་གི་བདག་ཉིད་ལ་ནི་བཅུད་ཀྱིས་གསོ། །
en: “ ‘That which has the nature of air is healed by nutrition.

source: བཀྲུ་སྨན་གྱིས་ནི་མཁྲིས་པ་བསལ་བར་བྱ། །
en: Laxative medicines are what dispel bile illness.

source: འདུས་པ་ལ་ནི་གསུམ་དང་མཐུན་ལྡན་པ། །
en: Aggregate illnesses will accord with all three.

source: བད་ཀན་ཚིགས་སུ་བབ་ན་སྐྱུགས་སྨན་གཏང་། །
en: For the class of phlegm, give emetic medicines.

source: རླུང་ཤས་ཆེ་དང་མཁྲིས་དང་འདུས་པ་དང་། །བད་ཀན་ཤས་ཆེའི་ཚིགས་རྣམས་ཤེས་པར་བྱ། །
en: “ ‘Know the groups that are primarily Air, bile, aggregation, or phlegm.

source: དུས་གང་ཁམས་གང་ལུས་ནི་གང་ཡིན་པ། །དེ་ཡི་སྨན་དང་བཟའ་བཏུང་བསྟན་པར་བྱ། །
en: Rely upon the medicines, food, and drink For whichever time, humor, and body.’

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ཆུ་འབེབས་ཀྱིས་ཁམས་ལ་མཁས་པར་བྱ་བ་འདི་ལྟ་བུ་དེ་ཙམ་ཞིག་ཡོངས་སུ་དྲིས་པ་དེས། ཚེའི་རིག་བྱེད་ཀྱི་ཡན་ལག་བརྒྱད་པོ་ཐམས་ཅད་ཁོང་དུ་ཆུད་པར་གྱུར་ཏོ། །རིགས་ཀྱི་ལྷ་མོ་དེའི་ཚེ་དེའི་དུས་ན་ཚོང་དཔོན་གྱི་བུ་ཆུ་འབེབས། རྒྱལ་པོ་ལྷའི་དབང་ཕྱུག་འོད་ཀྱི་ཡུལ་ན། གྲོང་དང་། གྲོང་ཁྱེར་དང་།
en: “Jalavāhana, the head merchant’s son, through just this inquiry into skill in the humors became learned in all the eight branches of the Āyurveda.

source: གྲོང་རྡལ་དང་། ལྗོངས་དང་། ཡུལ་འཁོར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་ཐམས་ཅད་དུ་སོང་ནས། སེམས་ཅན་ནད་སྣ་ཚོགས་ཀྱིས་བཏབ་པ།
en: “Noble goddess, at that time, in that time, Jalavāhana, the head merchant’s son went throughout all the villages, towns, market towns, countryside, realm, and the royal capital in the kingdom of King Sureśvaraprabha, and he said, ‘I will be a doctor for you many hundreds of thousands of beings who are afflicted by various illnesses and tormented by various illnesses.

source: ནད་སྣ་ཚོགས་ཀྱིས་གཟིར་བ་འབུམ་ཕྲག་དུ་མ་དེ་དག་ལ་ཁོ་བོ་ནི་སྨན་པའོ། །ཁོ་བོ་ནི་སྨན་པའོ། །ཞེས་བདག་ཉིད་ཀྱིས་ཁས་འཆེས་ཏེ། ཁོ་བོས་ཁྱེད་རྣམས་ནད་སྣ་ཚོགས་ལས་ཡོངས་སུ་ཐར་བར་བྱའོ་ཞེས་དབུགས་ཕྱུང་ངོ་། །
en: I promise to be your doctor and I will free you from your various illnesses and bring you relief.’

source: རིགས་ཀྱི་ལྷ་མོ་ཚོང་དཔོན་གྱི་བུ་ཆུ་འབེབས་ཀྱིས་འདི་ལྟ་བུའི་ཚིག་བརྗོད་པ་དེ་ཐོས་མ་ཐག་ཏུ་སྲོག་ཆགས་འབུམ་ཕྲག་དུ་མ་དེ་དག་ཐམས་ཅད་རབ་ཏུ་དགའ་བ་ཆེན་པོ་སྐྱེས་པར་གྱུར་ཏོ། །
en: “Noble goddess, when all those many hundreds of thousands of beings heard those words spoken by Jalavāhana, the head merchant’s son, they immediately felt great joy.

source: དབུགས་ཕྱིན་པ་རྙེད་ནས་ཀྱང་དགའ་བ་དང་། བདེ་བ་དང་། ཡིད་བདེ་བ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ལྡན་པར་གྱུར་ཏོ། །
en: They found relief and had inconceivable joy, happiness, and delight.

source: དེའི་ཚེ་དེའི་དུས་ན་སེམས་ཅན་ནད་སྣ་ཚོགས་ཀྱིས་བཏབ་པ། ནད་སྣ་ཚོགས་ཀྱིས་གཟིར་བ་འབུམ་ཕྲག་དུ་མ་དེ་དག་ནད་སྣ་ཚོགས་ལས་ཡོངས་སུ་ཐར་ཏེ་ནད་མེད་པར་གྱུར་ཏོ། །
en: “At that time, in that time, those many hundreds of thousands of beings who were afflicted by various illnesses and tormented by various illnesses were completely freed from their illness and became healthy.

source: ནད་མེད་པར་གྱུར་ནས་ཀྱང་སྔ་མ་ཁོ་ན་བཞིན་དུ། མཐུ་དང་། སྟོབས་དང་། བརྩོན་འགྲུས་དང་ལྡན་པར་གྱུར་ཏོ། །དེའི་ཚེ་དེའི་དུས་ན་སེམས་ཅན་ནད་སྣ་ཚོགས་ཀྱིས་བཏབ་པ། ནད་སྣ་ཚོགས་ཀྱིས་གཟིར་བ། འབུམ་ཕྲག་དུ་མ་དེ་དག་གི་ནང་ནས། གང་སུ་དག་ནད་དྲག་པོས་བཏབ་པ།
en: When they became healthy, they had the same power, strength and vigor as before.

source: དེ་དག་ཐམས་ཅད་ཚོང་དཔོན་གྱི་བུ་ཆུ་འབེབས་ག་ལ་བ་དེར་དོང་ནས་ཕྱིན་པ་དང་། སེམས་ཅན་ནད་སྣ་ཚོགས་ཀྱིས་བཏབ་པ། ནད་སྣ་ཚོགས་ཀྱིས་གཟིར་བ། འབུམ་ཕྲག་དུ་མ་དེ་དག་ལ་ཚོང་དཔོན་གྱི་བུ་ཆུ་འབེབས་ཀྱིས། སྨན་དཔྱད་གང་ཅི་བསྟན་པ་དེས་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱི་ནད་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱས་སོ། །
en: “At that time, in that time, all those who were afflicted with severe illnesses among the many hundreds of thousands of beings that were afflicted by various illnesses and tormented by various illnesses went to Jalavāhana, the head merchant’s son, and Jalavāhana, the head merchant’s son, cured all those beings of all their illnesses by using whatever medical treatments he had given the many hundreds of thousands of beings that were afflicted by various illnesses and tormented by various illnesses.

source: ནད་མེད་པ་དང་། ནད་ཉུང་བར་གྱུར་ནས་ཀྱང་སྔ་མཁོ་བཞིན་དུ་མཐུ་དང་། སྟོབས་དང་། བརྩོན་འགྲུས་དང་ལྡན་པར་གྱུར་ཏོ། །རིགས་ཀྱི་ལྷ་མོ་དེའི་ཆེ་དེའི་དུས་ན། རྒྱལ་པོ་ལྷའི་དབང་ཕྱུག་འོད་ཀྱི་ཡུལ་ན། གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ལྗོངས་དང་། ཡུལ་འཁོར་དང་།
en: They became free of illness, or their illness was diminished and they became healthy, and they had the same power, strength, and vigor as before.

source: རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་ཐམས་ཅད་ན། སེམས་ཅན་ནད་སྣ་ཚོགས་ཀྱིས་བཏབ་པ། ནད་སྣ་ཚོགས་ཀྱིས་གཟིར་བ། འབུམ་ཕྲག་དུ་མ་དེ་དག་ཐམས་ཅད་ཚོང་དཔོན་གྱི་བུ་ཆུ་འབེབས་ཀྱིས། ནད་སྣ་ཚོགས་ལས་ཡོངས་སུ་ཐར་བར་བྱས་པར་གྱུར་ཏོ། །
en: “Noble goddess, at that time, in that time, Jalavāhana, the head merchant’s son, freed from their various illnesses the many hundreds of thousands of beings who were afflicted by various illnesses and tormented by various illnesses throughout all the villages, towns, market towns, countryside, realm, and the royal capital in the kingdom of King Sureśvaraprabha.”

source: གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་ལས། ནད་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱས་པའི་ལེའུ་ཞེས་བྱ་སྟེ་ཉི་ཤུ་རྩ་བཞི་པའོ།། །།
en: This concludes “Ending All Illness,” the twenty-fourth chapter of “The Lord King of Sūtras, the Sublime Golden Light.”

source: རིགས་ཀྱི་ལྷ་མོ་གཞན་ཡང་རྒྱལ་པོ་ལྷའི་དབང་ཕྱུག་འོད་ཀྱི་ཡུལ་དུ། ཚོང་དཔོན་གྱི་ཁྱེའུ་ཆུ་འབེབས་ཀྱིས། སེམས་ཅན་ཐམས་ཅད་ནད་མེད་པར་བྱས་པས། ན་བ་ཉུང་ཞིང་སྔ་མཁོ་བཞིན་དུ་སྤྲོ་བ་དང་། སྟོབས་དང་ལྡན་པའི་ལུས་སུ་གྱུར་ཏོ། །
en: Chapter 25: The Story of the Fish Guided by Jalavāhana “And so, noble goddess, Jalavāhana, the head merchant’s son, had cured the illnesses in the kingdom of King Sureśvaraprabha, so that there were few illnesses and people had the enthusiasm and physical strength they had previously possessed.

source: རྒྱལ་པོ་ལྷའི་དབང་ཕྱུག་འོད་ཀྱི་ཡུལ་ན། སེམས་ཅན་ཐམས་ཅད་དགའ་ཞིང་རྩེ་ལ་དགའ་མགུར་སྤྱོད་དེ། སྦྱིན་པ་དག་ཀྱང་སྦྱིན་པར་བྱེད་བསོད་ནམས་དག་ཀྱང་བྱེད་དེ།
en: All the beings in the kingdom of King Sureśvaraprabha were happy, enjoyed amusements, performed acts of generosity, and created merit.

source: ཚོང་དཔོན་གྱི་ཁྱེའུ་ཆུ་འབེབས་ལ་ཡང་། ཚོང་དཔོན་གྱི་ཁྱེའུ་ཆུ་འབེབས་རྒྱལ་བར་གྱུར་ཅིག །
en: They praised Jalavāhana, the head merchant’s son, saying, ‘May Jalavāhana, the head merchant’s son, be victorious!

source: རྒྱལ་བར་གྱུར་ཅིག །
en: May he be victorious!

source: སྨན་པའི་རྒྱལ་པོ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ནད་གསོ་བ།
en: He is the king of healing, who heals the illnesses of all beings.
